examples/ack.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://www.oasis-open.org/committees/ebxml-msg/schema/envelope.xsd"
	xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd">
	<soap-env:Header>
		<eb:MessageHeader
			xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
			soap-env:mustUnderstand="1" eb:version="2.0">
			<eb:From>
				<eb:PartyId eb:type="zz">SLHW0224</eb:PartyId>
			</eb:From>
			<eb:To>
				<eb:PartyId eb:type="zz"></eb:PartyId>
			</eb:To>
			<eb:CPAId>self</eb:CPAId>
			<eb:ConversationId>1290456661217</eb:ConversationId>
			<eb:Service>urn:oasis:names:tc:ebxml-msg:service</eb:Service>
			<eb:Action>Acknowledgment</eb:Action>
			<eb:MessageData>
				<eb:MessageId>1290456661455@cdc.gov</eb:MessageId>
				<eb:Timestamp>2010-11-22T14:11:01</eb:Timestamp>
				<eb:RefToMessageId>statusResponse@cdc.gov</eb:RefToMessageId>
				<eb:RefToMessageId>1290456661217@phineas.us</eb:RefToMessageId>
			</eb:MessageData>
		</eb:MessageHeader>
		<eb:Acknowledgment
			xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
			soap-env:mustUnderstand="1" eb:version="2.0">
			<eb:Timestamp>2010-11-22T14:11:01</eb:Timestamp>
			<eb:RefToMessageId>1290456661217@phineas.us</eb:RefToMessageId>
		</eb:Acknowledgment>
	</soap-env:Header>
	<soap-env:Body>
		<eb:Manifest
			xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
			eb:version="2.0">
			<eb:Reference xlink:href="cid:statusResponse@cdc.gov"
				xlink:type="simple" />
		</eb:Manifest>
	</soap-env:Body>
</soap-env:Envelope>
